Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: In conversations at academic conferences and in social media exchanges, colleagues from other universities tell me they would like to try DITA in the future and make plans to contact me when they are working on their technical communication syllabus.
zh_cn: 在学术会议和社交媒体的交流中，来自其他大学的同事告诉我他们将来想尝试 DITA，并计划在制定技术传播课程大纲时联系我。

source: In this model, automation can be implemented as a problem-solving approach, but only after abstractions are applied in the development of structures in algorithmic workflows.
zh_cn: 在罗克利和戈尔纳的模型中，自动化可以视作一种解决问题的方法，但必须在算法工作流的结构开发中应用抽象概念才行。

source: Others argue that in the world of computing code verbose languages are becoming obsolete, but intelligent content still relies on XML and its nested tag structures:
zh_cn: 还有些人认为，在计算代码的世界中，冗长的语言已经过时了，但是智能内容仍然依赖于 XML 及其嵌套的标签结构：

source: Others will emphasize the role of automation even in Wing's definition of computational thinking.
zh_cn: 有些人会强调自动化的重要性，甚至在温对计算机思维的定义中也是如此。

source: represented in HDITA are the navigation element (<nav>) for opening a map environment, the title (<title> and 5) to label the map and its deliverables, and a hyper reference inside a list item (<a href> inside a <li>) to express a topic reference.
zh_cn: 有用以创建地图环境的导航元素 (<nav>)，标记地图及其交付物的标题元素 (<title> and 5)，以及表示话题引用的超级引用元素，该元素嵌套在列表项元素中 （即<a href> 嵌套在 <li>中）。

source: A casualty in the manual's demise, one could argue, was the main line of research that connected practitioners and academics in technical communication.
zh_cn: 可能有人会说，技术传播领域中将实践者和学者联系起来这一研究的主线随手册的消亡而被废弃。

source: After that, the conversation focused entirely on the “MarkDITA” prototype, which emphasized that there was an actual need for a Markdown-based LwDITA authoring format.
zh_cn: 后来的对话完全聚焦于“MarkDITA”原型，该原型强调对基于 Markdown 的 LwDITA 写作格式的实际需求确实存在。

source: As a result, every content component available in XDITA has a counterpart in HDITA.
zh_cn: 因此，XDITA中每个可用的内容组件在HDITA中都有对应的组件。

source: Creating Intelligent Content with Lightweight DITA does not have the purpose of minimizing the importance of computing automations, and by all means technical communicators should learn computing programming languages and workflows if given the chance.
zh_cn: 本书的目的并不是弱化计算自动化的重要性，如果有机会的话，技术传播人员应该通过各种方式学习计算机编程语言及其工作流。

source: Feedback from audiences to conference presentations about LwDITA, and comments from members of the DITA Technical Committee, introduced potential applications for the simplified standard outside of the traditional DITA domain of technical documentation.
zh_cn: 在之前的会议上，普里斯特利演示了 LwDITA，得到了与会者的反馈，结合 DITA 技术委员会成员评价，挖掘出了轻量级标准在技术文档传统的 DITA 领域之外的潜在应用场景。

source: Figure 4.1 shows a very brief DITA 1.3 topic with three list items: one with mixed content, one with just character data, and one with a child element without character data.
zh_cn: 图 4.1 显示了一个非常简短的DITA1.3 主题，它有三个列表项:一个包含混合内容，一个仅包含字符数据，还有一个包含不包含字符数据的子元素。

source: Guzdial adds that “achieving the goals of applying computing ideas to facilitate computing work in other disciplines is clearly achievable,” but “applying computing ideas in daily life is less likely” (2016, p.
zh_cn: 古齐亚尔补充说，“应用计算机思维来促进其他学科中的计算工作的目标显然是可以实现的，”但是“在日常生活中应用计算机是不太可能的” (2016, p.

source: The article went on to mention that Jeannette Wing “gets credit for making it fashionable” (Pappano, 2017).
zh_cn: 文章接着提到，珍妮特·温 (Jeannette Wing) “使计算思维变得流行起来，因而饱受赞扬” (Pappano, 2017)。

source: The same can be said about LwDITA work: creating content using the available authoring flavors is easy and even fun.
zh_cn: 对于LwDITA工作也是一样的:使用可用的创作风格来创建内容很简单，甚至可以说很有趣。

source: And if a different member of the
zh_cn: 如果厨房团队的其他成员

source: Applying this concept to content development or technical communication, we can place a deliverable (e.g., a standard operating procedure or a webpage) at that lowest level of abstraction, not as a static object but as a dynamic process.
zh_cn: 将这一概念应用到内容开发或技术传播中，我们可以将可交付内容（如一个标准化操作流程或一个网页）视为最低的抽象层级，并且将其看作一个动态过程，而非静态对象。

source: Figure 6.9 shows the franchise introductory topic in MDITA core profile with an atx heading for its title.
zh_cn: 图6.9 展示了根据 MDITA 核心规定编写的介绍特许经营权的话题，其标题使用 atx 语法格式编写。

source: For a discourse community of technical communicators producing computer manuals before the dawn of minimalism in technical communication, those rhetorical conventions were documented and analyzed in computing-related publications - and those are the origins of LwDITA and intelligent content.
zh_cn: 在极简主义进入技术传播领域前，在撰写计算机手册的技术传播工程师所组成的话语体系中，计算相关的出版物中记录并分析了这些修辞惯例- 并且这些惯例成为了轻量级DITA的起源。

source: I added some extra elements (in bold font) to implement the information types mentioned by Priestley et al.
zh_cn: 我添加了一些额外元素(粗体显示)来实现普里斯特利等人在前一段中提到的信息类型

source: Note that the “minimize elements that allow mixed content” also applies to HDITA topics.
zh_cn: 请注意，“包含混合内容的最小化元素”原则也适用于 HDITA 话题。

source: She succinctly defines abstraction as “the essence of computational thinking” (2008, p.
zh_cn: 她简洁地将抽象定义为“计算机思维的本质” (2008, p.

source: Gu & Pullman presented that scenario in 2009, and technical writing jobs have not become assembly-line positions (at least not yet).
zh_cn: 该设想由古和铂尔曼于2009年提出，而技术写作并没有变成一个流水线上的职位（至少现在还没有)。

source: More than two decades after Johnson-Eilola's model was published, abstraction continues to be a desired skill in the training and work of technical communicators.
zh_cn: 在约翰逊·艾劳拉的模型发表20多年后，抽象仍然是技术传播人员在培训和工作中所需要的技能。

source: Some DITA XML elements, like <p> for paragraph or <li> for list item, are relevant for any type of information and are present in HTML - the lingua franca of the web.
zh_cn: 一些DITA XML元素，如段落< tb1 ，列表项<li> ，与任何类型的信息都相关，并且以网络上HTML - 通用语言的形式存在。

source: Topic-based writing is described as “authoring an information set as a collection of discrete units called topics, rather than as a whole book or help system” (Baker, 2016 p.
zh_cn: 基于话题的写作会“编写一个信息集，聚合不同话题的离散单元，而编写一本书或一个帮助系统”（贝克，2016年，第

source: Wing's model of computational thinking, which I introduced in Chapter 1, highlights the importance of abstractions over numerical processes and algorithms.
zh_cn: 在第一章中我介绍过温的计算思维模型，该模型强调了抽象能力的重要性，数值计算和算法能力都位列其后。

source: A positive side comes from the order and consistency in content that structured authoring methodologies enable.
zh_cn: 积极的一面则是结构化创作带来的内同的有序性和一致性。

source: Chapters 7 and 8 present an analysis of the abstractions behind the computational thinking and rhetorical problem solving processes that generate intelligent content with LwDITA, but the next section focuses on the potential benefits of LwDITA for content developers who do not need the features of full DITA XML.
zh_cn: 第七章和第八章分析了在使用 LwDITA 编写智能内容时，隐藏在计算机思维和解决修辞问题过程背后的抽象概念，但下一节将重点讨论对于不需要使用 DITA XML 各种特性的内容开发人员来说， LwDITA 的潜在好处。

source: In academia, scholars have praised Extensible Markup Language (XML) as the foundation for information reuse, single sourcing, and, particularly, content management for more than a decade.
zh_cn: 在学术界，学者们一直赞誉可扩展标记语言（Extensible Markup Language，XML）是一个多世纪以来信息重用、同源开发、特别是内容管理的基础。

source: That same obsession is behind the methodology of structured authoring of technical information, which is all about “capturing, guiding, and validating the content, order, and form of a piece of content” (Baker, 2013, p.
zh_cn: 技术信息结构化创作方法的背后也蕴藏着同样地痴迷，即对“内容片段的内容、顺序和形式进行捕获、引导和验证的痴迷”。 (Baker, 2013, p.

source: The DQTI quality characteristics, which still show some resemblance to the requirements from PQTI, are,
zh_cn: DQTI的质量特征与PQTI的要求仍有一些相似之处，

source: all increasing expectation about the proposed standard but working to the detriment of the subcommittee's actual purpose of developing the technical specification for an open standard and not software applications or industry-specific workflows.
zh_cn: 大家对提议的标准的期望在不断增加，但这却有损小组委员会的实际目的：为开放标准开发技术规范，而不是为了软件程序或特定行业的工作流开发。

source: <title> contains <ph> or text
zh_cn: <title> 包含 <ph> 或文本

source: <topic> contains <title>, <shortdesc> (short description), <body>
zh_cn: <topic> 包含 <title>、<shortdesc> （简短介绍）和 <body

source: <topicmeta> contains <navtitle> (navigation title)
zh_cn: <topicmeta> 包含 <navtitle> （导航标题）

source: <topicref> contains <topicmeta> (topic metadata) or a new version of <topicref> including <title> as option before <topicmeta>
zh_cn: <topicref> 包含 <topicmeta> （话题元数据）或新版 <topicref> 中，<title> 作为可选项，可以出现在 <topicmeta>前

source: <ul>/<ol> contain <li> (list item)
zh_cn: <ul>或<ol> 包含 <li> （列表项目）

source: <xref> contains text
zh_cn: <xref> 包含文本

source: A LwDITA-aware tool like Oxygen XML would inform the author that the topic is incomplete.
zh_cn: 支持 LwDITA 的工具（如 Oxygen XML）会提示创作者该话题不完整。

source: A Topic by Any Other Name .
zh_cn: 主题的其他名称 .

source: A basic topic can also include a flexible procedure, or even provide pointers for a web-based product tour with some JavaScript processing, among many other applications.
zh_cn: 一个基本话题的操作非常灵活，甚至可以用 JavaScript 脚本为网页产品的体验提供标识。

source: A certain kind of colleague who still writes in a command-line environment using a text editor like Vim would promptly procure pseudo-evidence to build a case arguing that developers and users have lost the “itch” to tinker with software and hardware because the manual is no longer there to guide them and provide hundreds of reference points.
zh_cn: 还有一类同事仍在使用类似Vim的文本编辑器在命令行界面中进行写作，他很快就能想出来一个看似证据充足的案例来证明开发者和用户失去了改进软件和硬件的渴望，因为没有手册能够给他们提供指引和上百例参考条目。

source: A chef might not be familiar with scholarship in writing studies, but authors like Karl Stolley, in his influential “The Lo-Fi Manifesto,” have argued for the adoption of open standards over software packages, identifying it as the only way to ensure that “digital works should long outlast the software that played a role in their creation” (Stolley, 2008).
zh_cn: 厨师可能不太认识研究写作的学者，但卡尔·斯多利等作者在其颇具影响的文章《低保真宣言》（The Lo-Fi Manifesto）中主张在软件包中采用开放标准，并认为这是唯一可以确保“在数字作品的创作过程中，使数字作品比软件流传更加久远”的方法（斯多利，2008年）。

source: A computer programmer would take the sum of those abstractions to design an algorithm and automate a routine, but for an author the final outcome is to think and see what the content can accomplish once it is liberated from the word processing or web presentational models.
zh_cn: 计算机程序员可以利用这些抽象概念来设计算法和编写自动化程序，而对于创作者来说，抽象概念最终将有助于思考和见证一旦内容从文字处理软件或网页演示模型中解放出来，能产出什么成果。

source: A conventional HTML editor probably will not be able to process the file as an HDITA map, and that's when the authors would need a LwDITA-aware tool or the DITA-OT.
zh_cn: 传统的 HTML 编辑器可能无法解析 HDITA 地图，这时创作者就需要支持 LwDITA 的工具或 DITA-OT 的帮助。

source: A core argument in this book is based on Wing's definition of computational thinking, previous research about abstractions in technical communication, the work I have conducted as co-chair of the Lightweight DITA subcommittee at OASIS, and my experience teaching DITA at the college level since 2006 and LwDITA since 2015.
zh_cn: 这本书的核心观点基于温定义的计算机思维、之前技术传播领域对抽象化的研究、我作为 OASIS 轻量级 DITA 小组委员会联合主席所开展的工作以及我从2006年开始在大学中教授 DITA 和2015年开始教授 LwDITA 的经历。

source: A couple of months after he introduced the first LwDITA topic prototype, which he called the “strawman proposal,” Michael Priestley made an announcement that surprised more than one DITA user or developer: the Information Mapping® (IM) content types would be available in the LwDITA catalog of content templates.
zh_cn: 迈克尔·普里斯特利在介绍了第一个LwDITA话题原型（他称之为“稻草人提案”）的几个月后，宣布了一个令许多DITA用户或开发人员吃惊的消息：将可以在LwDITA内容模板中使用信息映射（Information Mapping® ，IM）内容类型。

source: A definition of topic from Lawrence Prelli further supports this overlap.
zh_cn: 劳伦斯·普雷利 （Lawrence Prelli）对主题的定义进一步支持了这种重叠。

source: A few days after my initial call with Priestley, the topic of including Markdown as a component of the LwDITA proposal appeared in the minutes of the DITA Technical Committee call from May 10, 2014.
zh_cn: 在我与普里斯特利进行了最初的电话交谈的几天后，也就是2014年5月10日，DITA 技术委员会那天的电话会议记录上记录了关于将 Markdown 作为 LwDITA 一个组成部分的提案内容。

source: A few weeks after I interviewed John Carroll, the influential technical communication blogger Tom Johnson talked to him at the Society for Technical Communication Summit.
zh_cn: 在我采访约翰·卡罗尔的数周后，颇具影响力的技术传播博主汤姆•约翰逊（Tom Johnson）在技术交流协会峰会上与他进行了交谈。

source: A glossary, which defines terms mentioned in the book and is presented at the end of the book.
zh_cn: 书的结尾应该有术语表，定义书中提到的所有术语。

source: A key feature of LwDITA is cross-format collaboration and compatibility.
zh_cn: LwDITA 的一个关键特性是跨格式的协作和兼容。

source: A later issue of Asterisk included a more detailed “User Manual Outline,” authored by Joe Rigo (he of the prestigious ACM SIGDOC Rigo Award).
zh_cn: Asterisk后来还出了一期更加详细的“用户手册大纲”，作者乔·里戈（Joe Rigo）是计算机协会计算机文档里戈奖创始人。

source: A learning curve that gets less steep every time.
zh_cn: 学习曲线趋于平缓、

source: A major task with the subcommittee was the creation of working groups in charge of developing user personas and usage scenarios for the LwDITA authoring formats.
zh_cn: 小组委员会的一个主要任务是成立工作组，负责为 LwDITA 写作格式创建用户画像和研究使用场景。

source: A modern content-development lifecycle is an important connector for establishing those relations, and that is the overarching topic of the following sections.
zh_cn: 现代内容开发的生命周期是建立这些关系的重要连接器，下面几节将重点介绍。

source: A more discerning audience, aware that users' “inability to understand a manual is not a reflection on them but on those who created and published the manual.
zh_cn: 明眼人则会意识到，用户无法理解手册，问题不出在用户上而是那些创建和出版手册的人身上。

source: A need “to get the reader productive right away,” claiming that a reader “cannot, and will not, spare the time for a long period of learning for a product or procedure that is supposed to be simple and easy to use or do, maintain, or repair” (Cohen & Cunningham, 1984, p.1).
zh_cn: “读者能立刻上手”这一要求意味着读者“不能也不会花费很长的时间去学习产品或学习本应简单的使用、运行、维护、维修过程” (Cohen & Cunningham, 1984, p.1).

source: A sample sushi recipe from the restaurant's cookbook.
zh_cn: 餐厅菜谱中的寿司食谱样例

source: A search for “XML” on amazon.com reveals more than 1,100 results under the “Books: Computers & Technology: Programming Languages” category.
zh_cn: 在亚马逊网站上搜索“XML”，在“图书-计算机和技术-编程语言”类别下，有1100多个搜索结果。

source: A second edition of DQTI came out in 2004, and it added a group of coauthors after Hargis's name.
zh_cn: DQTI在2004年出版了第二版，哈吉斯名字后新增了一大批合著者。

source: A similar syntax structure would be valid in HTML53.
zh_cn: 类似的语法结构也适用于HTML53。

source: A simplified version of DITA XML (XDITA) was the original LwDITA flavor and, for a few months after Priestley proposed this new standard, the only one.
zh_cn: DITA XML (XDITA)的简化版本是最初的LwDITA风格，在普里斯特利提出这个新标准后的几个月里，它是唯一的标准。

source: A starting point to assess that knowledge can come from the International Society for Technology in Education (ISTE) Standards for Students, which include a rubric to standardize the assessment of computational thinking across the curriculum.
zh_cn: 国际教育技术学会 (ISTE) 学生标准能够评估所有学科的计算机思维，可以作为评估学生计算机知识的入门标准。

source: A table of contents, which lists all the main sections at the beginning of the book.
zh_cn: 书的开篇应有目录列出所有主要的章节。

source: A topic is “a self-contained unit of information.
zh_cn: 话题是“一个自包含的信息单元，

source: A valid XDITA topic needs, at least, a title, which is represented by the XML element <title>.
zh_cn: 一个有效的 XDITA 话题至少需要一个标题，由 XML 元素 <title> 表示。。

source: A very important disclaimer: Despite the benefits of adopting an intelligent content workflow with LwDITA, there are many situations and contexts that would be better off without it.
zh_cn: 一则非常重要的免责声明：尽管使用LwDITA智能内容工作流有很多好处，但是在许多情况和语境下，有其他更好的选择。

source: A word processor successfully abstracts the process of separating computing rules for content and format, but as a result keeps the content locked in one deliverable.
zh_cn: 文字处理器成功地将分离计算规则的过程进行了抽象，这些规则分别应用在内容和格式上，但其结果是将内容锁定在某个可交付文件中。

source: Abstraction allows authors of intelligent content to separate the “layers” of a particular problem, and work on each one individually without concern for the others.
zh_cn: 拥有抽象能力，编写智能内容的创作者能够分离特定问题的“层级”，并单独处理每个层级，而无需关心其他层级。

source: Abstraction allows humans to separate the “layers” of a particular problem and work on each one individually without concern for the others.
zh_cn: 抽象允许人们分离特定问题的“层级”，并单独处理每个层级，而无需关心其他层级。

source: Abstractions for content creators are ways of thinking before structuring information and seeing its future applications.
zh_cn: 对内容创作者来说，抽象是在构建信息结构和预想软件未来形态之前思考的方式。

source: Abstractions in the Intelligent Content Process
zh_cn: 创建智能内容过程中的抽象概念

source: According to Priestley, “if there are three ways of doing things with full DITA, there will be only one way to do it with Lightweight DITA.”
zh_cn: 按照普里斯特利的说法，“如果使用完整版 DITA 有三种不同的方法可以实现目标，那么使用轻量级 DITA 将只有一种方法。”

source: According to its introduction, the 3rd edition of DQTI focused on,
zh_cn: 根据简介，第三版 DQTI 主要关注，

source: According to the DITA-OT documentation, the command that builds DITA (and LwDITA) deliverables from topics and maps from a Terminal or Command Prompt window looks like Figure 5.5
zh_cn: 参考 DITA-OT 文档，从终端或命令提示符窗口利用话题和地图构建 DITA（和 LwDITA）交付物的命令如图5.5所示。

source: According to the W3C recommendation for HTML5, the “document's title is often different from its first heading, since the first heading does not have to stand alone when taken out of context.” (W3C, 2017).
zh_cn: 根据 W3C 对该如何使用 HTML5 提出的建议，“文档的标题通常与文档内容中的第一个标题不同，因为文档内容中的第一个标题在脱离上下文时不一定要独立存在。”(W3C, 2017)。

source: Accuracy
zh_cn: 准确

source: Across industries and professions, just mentioning the word “automation” can strike fear of humans (and/or their jobs) becoming obsolete, and technical communication is no exception.
zh_cn: 在各行各业中，只要提到“自动化“这个词，就会让人害怕自己 （和/或自己的工作）被淘汰，技术传播领域也不例外。

source: Actually, the answer (for the manual's disappearance) is not minimalism, but money.” Carroll explained that with computing systems like notebook computers and smartphones (which are considerably more affordable than their mainframe ancestors in the 1980s and earlier), “there's no way to economically produce definitive manuals that cheap.
zh_cn: 实际上，（手册消失）的原因并不是极简主义而是金钱。”卡罗尔解释道，利用笔记本和智能机等计算系统（价钱要远低于20世纪80年代以前的大型机），“没法生产出既定义明确又价格低廉的手册”

source: Adding to the conversation about turning characteristics into elements or conventions, Carey et al.
zh_cn: 凯里（Carey）等人还谈到了如何将特征转化为元素或惯例

source: Additionally, Chef Pedro could link the HDITA topics to an external CSS file for formatting.
zh_cn: 此外，佩德罗还可以将 HDITA 话题与外部 CSS 文件进行关联，将网页格式化。

source: Additionally, Hargis organized the characteristics “by their ability to make information” in the following groups: easy to use, easy to understand, and easy to find (Hargis, 1998, p.
zh_cn: 此外，哈吉斯“根据他们制造信息的能力”将特征分为以下几组：易使用、易理解、易查找(Hargis, 1998, p.

source: Additionally, O'Keefe provides a sample XML file that presents a recipe for making marinara sauce.
zh_cn: 此外，奥基夫提供了一个 XML 文件作为示例，该文件是一份制作意式番茄罗勒酱的食谱。

source: Additionally, from a perspective addressing the needs of managers and supervisors, Hackos presents a list of DITA's business advantages, which suggest that the standard will (promote) the reuse of information quickly and easily across multiple deliverables, reduce the cost of maintaining and updating information, enable continuous publishing, share information across the global enterprise, reduce the cost of localization, and reduce the technical debt caused by inadequate, incorrect, and unusable legacy information (Hackos, 2011, p.
zh_cn: 此外，从解决部门经理、主管的需求来看， 哈克斯列出了 DITA 的商业优势, 这表明，DITA 将简明迅速地促进信息跨交付物重用能力，降低维护和更新信息的成本，实现不间断出版，在全球企业内共享信息，降低本地化的成本,并减少由错误、不够完善、无法使用的遗留信息引起的技术债务。 （哈克斯，2011年，第

source: Additionally, the Lightweight DITA subcommittee will continue working on new releases of the proposed standard, which can include more content types based on user feedback and interest.
zh_cn: 此外，轻量级 DITA 小组委员会继续致力于改进提议的标准，根据用户反馈和兴趣点包含更多的内容类型。

source: Additionally, the Lightweight DITA subcommittee with OASIS is exploring the possibility of releasing a template-based mechanism for specialization that would make the customization of topics and elements more accessible to authors who are not familiar with XML schema or document type definitions.
zh_cn: 此外，OASIS 轻量级 DITA 小组委员会正在研究基于模板的专门化机制的可能性，这将使不熟悉 XML 模式或文档类型定义的作者更容易定制话题和元素。

source: Additionally, the XDITA and HDITA content models were designed to be functionally equivalent to each other, while MDITA was introduced as a compatible subset.
zh_cn: 此外，XDITA 和 HDITA 内容模型功能对等，而 MDITA 是作为兼容性子集引入的。

source: Additionally, the reports emphasized the need for components that would allow the inclusion of multimedia content in LwDITA topics.
zh_cn: 此外，报告还强调了组件的必要性，有了组件将可以在 LwDITA 话题中包含多媒体内容。

source: Additionally, the versatile task topic in DITA 1.3 can take the shape of a general task topic, a strict task, or a machinery task topic, depending on the context and purpose of usage.
zh_cn: 此外，DITA 标准1.3版本中灵活的任务话题可以依据语境和使用目的以通用任务话题、严格任务或机械任务话题的形式呈现。

source: Adoption numbers and success stories should not hide that the evolution of intelligent content takes place on a slightly rocky path; even in practitioner circles, there is pushback and criticism against XML and its relationship with technical communication.
zh_cn: 使用 DITA 的用户数量和成功案例也无法掩饰智能内容的发展是在一条略崎岖的道路上进行的。甚至在从业者的圈子内，也存在对XML及其与技术传播的关系的反对声和批评声。

source: Adventurous novice content creators.
zh_cn: 具有探险精神的内容创作新手。

source: After a few years of preparing prototypes and drafts, receiving audience feedback and managing anticipation, LwDITA started 2017 with the official format that would be documented on the first formal deliverable of the Lightweight DITA subcommittee at OASIS.
zh_cn: 小组委员会一直在设计原型和草案，接收用户反馈并管理用户预期，经过几年的准备，2017 年 LwDITA 完成了，其官方格式将记录在 OASIS 轻量级 DITA 小组委员会的第一个正式交付版本中。

source: After all, XML-based DITA had been quite successful at IBM since the late 1990s and then became an internationally- adopted standard for structuring and publishing content in 2005.
zh_cn: 毕竟，自20世纪90年代末基于XML的DITA以来在IBM非常成功，并在2005年成为一种用于结构和发布内容的国际通用标准。

source: After receiving feedback from the DITA Technical Committee, Priestley revised the proposal and, in the summer of 2012, updated the list of topical elements to include 27 XML tags (<object>, <note>, and elements related to definition lists were among those added to the original proposal).
zh_cn: 在收到DITA技术委员会的反馈后，普里斯特利修改了提案，并在2012, 年夏天更新了话题元素列表，更新后包括27 个XML标签（<object>、<note>以及和定义列表相关的元素都在原始提案中）。

source: After teaching and researching how to create intelligent content with DITA for more than a decade, I have seen how the majority of my students can adapt the generic DITA topic to a variety of information structures and projects.
zh_cn: 我教授和研究如何使用 DITA 创建智能内容十多年，知道大多数学生是如何使用通用的 DITA 话题编写各种信息结构和项目的。

source: After years of fielding the question “Is DITA related to Information Mapping?”, the Information Mapping company released a white paper, in 2011, titled “Information Mapping® and DITA: Two Worlds, One Solution.” The white paper had the objective of explaining “why it does not make sense to move from Information Mapping® to DITA, or vice versa,” and it posited that “Information Mapping® and DITA both have their strengths and weaknesses, and combining them may lead to the best results for an organization” (2011, p.
zh_cn: 信息映射公司多年来一直在回答一个问题：“ DITA 与信息映射有关吗?”2011年，信息映射公司发布了《信息映射® 和 DITA：两个世界，一个解决方案》白皮书。白皮书旨在解释“为什么从信息映射® 转换到 DITA 是没有意义的，反之亦然”，白皮书表示“信息映射® 和 DITA 有各自的优缺点，将二者结合可以达到最佳效果”（2011年，第

source: All code examples in this book will focus on the open standards for DITA and LwDITA, and automation-related discussions will be based on features and affordances from the open source DITA-OT and “raw” XML, HTML5, and Markdown code.
zh_cn: 本书中的所有代码示例都将聚焦于 DITA 和 LwDITA 开放标准，与自动化相关的讨论将基于开源的DITA-OT，以及原生 XML、HTML5 和 Markdown 代码的特性和功能。

source: All their topics are treated as DITA and can take advantage of the standard's reuse, filtering, and single-sourcing capabilities.
zh_cn: 所有话题都被视为 DITA，可以利用 DITA 内容复用、内容过滤和同源开发的特性。

source: All three LwDITA formats are compatible with each other and with DITA XML.
zh_cn: 这三种 LwDITA 格式彼此兼容，并且与 DITA XML 兼容。

source: All three list items are valid in DITA 1.3.
zh_cn: 这三个列表项在DITA 1.3中都有效。<片段
